# Ex3 - Getting and Knowing your Data



### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [3]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries
Solve it by 2 different ways

In [4]:
users.head(25)

users[0:26]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107
26        49      M       engineer    21044

### Step 5. See the last 10 entries

In [5]:
users.tail(10)

     index  user_id  age gender     occupation zip_code
933    933      934   61      M       engineer    22902
934    934      935   42      M         doctor    66221
935    935      936   24      M          other    32789
936    936      937   48      M       educator    98072
937    937      938   38      F     technician    55038
938    938      939   26      F        student    33319
939    939      940   32      M  administrator    02215
940    940      941   20      M        student    97229
941    941      942   48      F      librarian    78209
942    942      943   22      M        student    77841

### Step 6. What is the number of observations in the dataset?
Solve it by 2 different ways

In [6]:
users.shape[0]

943

### Step 7. What is the number of columns in the dataset?
Solve it by 2 different ways

In [7]:
users.shape[1]

6

### Step 8. Print the name of all the columns.

In [8]:
print(users.columns)

Index(['index', 'user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed? Get the index values

In [9]:
users.index

RangeIndex(start=0, stop=943, step=1)

### Step 10. What is the data type of each column?
Solve it by 2 different ways

In [11]:
for column in users.columns:
    print(type(column))

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

### Step 11. Print only the occupation column
Solve it by 2 different ways

In [12]:
print(users['occupation'])

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset? How many users per occupation are in the dataset?

In [25]:
print(len(users.occupation.unique()))
users.groupby('occupation').count()

21
0        0
1        1
2        2
3        3
4        4
      ...
938    938
939    939
940    940
941    941
942    942
Name: index, Length: 943, dtype: int64

               index  user_id  age  gender  zip_code
occupation
administrator     79       79   79      79        79
artist            28       28   28      28        28
doctor             7        7    7       7         7
educator          95       95   95      95        95
engineer          67       67   67      67        67
entertainment     18       18   18      18        18
executive         32       32   32      32        32
healthcare        16       16   16      16        16
homemaker          7        7    7       7         7
lawyer            12       12   12      12        12
librarian         51       51   51      51        51
marketing         26       26   26      26        26
none               9        9    9       9         9
other            105      105  105     105       105
programmer        66       66   66      66        66
retired           14       14   14      14        14
salesman          12       12   12      12        12
scientist         31       31   31      31        31
student          196      196  196     196       196
technician        27       27   27      27        27
writer            45       45   45      45        45

### Step 13. What is the most frequent occupation?

In [5]:
users.occupation.mode().values[0]

'student'

In [6]:
users.occupation.value_counts().index[0]

'student'

In [9]:
users['occupation','age'].groupby('occupation').count().idxmax().values[0]

KeyError: ('occupation', 'age')

### Step 14. Summarize the DataFrame.

In [30]:
users.describe()

            index     user_id         age
count  943.000000  943.000000  943.000000
mean   471.000000  472.000000   34.051962
std    272.364951  272.364951   12.192740
min      0.000000    1.000000    7.000000
25%    235.500000  236.500000   25.000000
50%    471.000000  472.000000   31.000000
75%    706.500000  707.500000   43.000000
max    942.000000  943.000000   73.000000

### Step 15. Summarize all the columns

In [32]:
users.columns.describe()

AttributeError: 'Index' object has no attribute 'describe'

### Step 16. Summarize only the occupation column

In [31]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [33]:
users.age.mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [36]:
users.groupby('age').count().sort_values('index').head(10)

     index  user_id  gender  occupation  zip_code
age
7        1        1       1           1         1
66       1        1       1           1         1
73       1        1       1           1         1
10       1        1       1           1         1
11       1        1       1           1         1
62       2        2       2           2         2
69       2        2       2           2         2
68       2        2       2           2         2
64       2        2       2           2         2
58       3        3       3           3         3